In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn

In [21]:
dataset = pd.read_csv("DATA2.csv")

In [9]:
df = pd.DataFrame(dataset)

In [10]:
df

       Name   Age  Marks Performance
0     Rohan  18.0   60.0          No
1  Spoorthi  22.0   70.0         Yes
2       Ram  21.0   67.0          No
3    Sachin  20.0   76.0          No
4     Madhu  26.0    NaN         Yes
5       Sam  23.0   58.0         Yes
6       Anu   NaN   80.0          No
7  Bharathi  24.0   90.0         Yes
8     Sammu  25.0    NaN          No
9      Asha  28.0   82.0         Yes

In [11]:
df.isnull().sum()

Name           0
Age            1
Marks          2
Performance    0
dtype: int64

In [12]:
df[df.isnull().any(axis=1)]

    Name   Age  Marks Performance
4  Madhu  26.0    NaN         Yes
6    Anu   NaN   80.0          No
8  Sammu  25.0    NaN          No

In [13]:
df2 = df.copy()

In [14]:
mean_salary = df['Age'].mean()
df['Age'] = df['Age'].fillna(mean_salary)
avg_age = df['Marks'].mean()
df['Marks'] = df['Marks'].fillna(avg_age)
df

       Name   Age   Marks Performance
0     Rohan  18.0  60.000          No
1  Spoorthi  22.0  70.000         Yes
2       Ram  21.0  67.000          No
3    Sachin  20.0  76.000          No
4     Madhu  26.0  72.875         Yes
5       Sam  23.0  58.000         Yes
6       Anu  23.0  80.000          No
7  Bharathi  24.0  90.000         Yes
8     Sammu  25.0  72.875          No
9      Asha  28.0  82.000         Yes

In [15]:
df.isnull().sum()

Name           0
Age            0
Marks          0
Performance    0
dtype: int64

In [16]:
# printing these 6 'nan' containing rows --> axis=1 means only true value will be displayed

df2[df2.isnull().any(axis=1)]

    Name   Age  Marks Performance
4  Madhu  26.0    NaN         Yes
6    Anu   NaN   80.0          No
8  Sammu  25.0    NaN          No

In [17]:
df.isnull().sum()

Name           0
Age            0
Marks          0
Performance    0
dtype: int64

In [18]:
df3 = df.copy()

In [19]:
# FIRST MENTHOD: DROPNA

# summarize the shape of the raw data
print("Before:",df3.shape)

# drop rows with missing values
df3.dropna(inplace=True)

# summarize the shape of the data with missing rows removed
print("After:",df3.shape)

Before: (10, 4)
After: (10, 4)